apache/nuttx/arch/arm/src/nrf52/hardware/nrf52_uarte.h
#ifdef CONFIG_NRF52_UART1
#  define NRF52_UARTE1_TASKS_STARTRX        (NRF52_UARTE1_BASE + NRF52_UARTE_TASKS_STARTRX_OFFSET)
#  define NRF52_UARTE1_TASKS_STOPRX         (NRF52_UARTE1_BASE + NRF52_UARTE_TASKS_STOPRX_OFFSET)
#  define NRF52_UARTE1_TASKS_STARTTX        (NRF52_UARTE1_BASE + NRF52_UARTE_TASKS_STARTTX_OFFSET)
#  define NRF52_UARTE1_TASKS_STOPTX         (NRF52_UARTE1_BASE + NRF52_UARTE_TASKS_STOPTX_OFFSET)
#  define NRF52_UARTE1_TASKS_FLUSHRX        (NRF52_UARTE1_BASE + NRF52_UARTE_TASKS_FLUSHRX_OFFSET)
#  define NRF52_UARTE1_EVENTS_CTS           (NRF52_UARTE1_BASE + NRF52_UARTE_EVENTS_CTS_OFFSET)
#  define NRF52_UARTE1_EVENTS_NCTS          (NRF52_UARTE1_BASE + NRF52_UARTE_EVENTS_NCTS_OFFSET)
#  define NRF52_UARTE1_EVENTS_RXDRDY        (NRF52_UARTE1_BASE + NRF52_UARTE_EVENTS_RXDRDY_OFFSET)
#  define NRF52_UARTE1_EVENTS_ENDRX         (NRF52_UARTE1_BASE + NRF52_UARTE_EVENTS_ENDRX_OFFSET)
#  define NRF52_UARTE1_EVENTS_TXDRDY        (NRF52_UARTE1_BASE + NRF52_UARTE_EVENTS_TXDRDY_OFFSET)
#  define NRF52_UARTE1_EVENTS_ENDTX         (NRF52_UARTE1_BASE + NRF52_UARTE_EVENTS_ENDTX_OFFSET)
#  define NRF52_UARTE1_EVENTS_ERROR         (NRF52_UARTE1_BASE + NRF52_UARTE_EVENTS_ERROR_OFFSET)
#  define NRF52_UARTE1_EVENTS_RXTO          (NRF52_UARTE1_BASE + NRF52_UARTE_EVENTS_RXTO_OFFSET)
#  define NRF52_UARTE1_EVENTS_RXSTARTED     (NRF52_UARTE1_BASE + NRF52_UARTE_EVENTS_RXSTARTED_OFFSET)
#  define NRF52_UARTE1_EVENTS_TXSTARTED     (NRF52_UARTE1_BASE + NRF52_UARTE_EVENTS_TXSTARTED_OFFSET)
#  define NRF52_UARTE1_EVENTS_TXSTOPPED     (NRF52_UARTE1_BASE + NRF52_UARTE_EVENTS_TXSTOPPED_OFFSET)
#  define NRF52_UARTE1_SHORTS               (NRF52_UARTE1_BASE + NRF52_UARTE_SHORTS_OFFSET)
#  define NRF52_UARTE1_INTEN                (NRF52_UARTE1_BASE + NRF52_UARTE_INTEN_OFFSET)
#  define NRF52_UARTE1_INTENSET             (NRF52_UARTE1_BASE + NRF52_UARTE_INTENSET_OFFSET)
#  define NRF52_UARTE1_INTENCLR             (NRF52_UARTE1_BASE + NRF52_UARTE_INTENCLR_OFFSET)
#  define NRF52_UARTE1_ERRORSRC             (NRF52_UARTE1_BASE + NRF52_UARTE_ERRORSRC_OFFSET)
#  define NRF52_UARTE1_ENABLE               (NRF52_UARTE1_BASE + NRF52_UARTE_ENABLE_OFFSET)
#  define NRF52_UARTE1_PSEL_RTS             (NRF52_UARTE1_BASE + NRF52_UARTE_PSEL_RTS_OFFSET)
#  define NRF52_UARTE1_PSEL_TXD             (NRF52_UARTE1_BASE + NRF52_UARTE_PSEL_TXD_OFFSET)
#  define NRF52_UARTE1_PSEL_CTS             (NRF52_UARTE1_BASE + NRF52_UARTE_PSEL_CTS_OFFSET)
#  define NRF52_UARTE1_PSEL_RXD             (NRF52_UARTE1_BASE + NRF52_UARTE_PSEL_RXD_OFFSET)
#  define NRF52_UARTE1_BAUDRATE             (NRF52_UARTE1_BASE + NRF52_UARTE_BAUDRATE_OFFSET)
#  define NRF52_UARTE1_RXD_PTR              (NRF52_UARTE1_BASE + NRF52_UARTE_RXD_PTR_OFFSET)
#  define NRF52_UARTE1_RXD_MAXCNT           (NRF52_UARTE1_BASE + NRF52_UARTE_RXD_MAXCNT_OFFSET)
#  define NRF52_UARTE1_RXD_AMOUNT           (NRF52_UARTE1_BASE + NRF52_UARTE_RXD_AMOUNT_OFFSET)
#  define NRF52_UARTE1_TXD_PTR              (NRF52_UARTE1_BASE + NRF52_UARTE_TXD_PTR_OFFSET)
#  define NRF52_UARTE1_TXD_MAXCNT           (NRF52_UARTE1_BASE + NRF52_UARTE_TXD_MAXCNT_OFFSET)
#  define NRF52_UARTE1_TXD_AMOUNT           (NRF52_UARTE1_BASE + NRF52_UARTE_TXD_AMOUNT_OFFSET)
#  define NRF52_UARTE1_CONFIG               (NRF52_UARTE1_BASE + NRF52_UARTE_CONFIG_OFFSET)

#  define NRF52_UART1_TASKS_STARTRX         (NRF52_UART1_BASE + NRF52_UART_TASKS_STARTRX_OFFSET)
#  define NRF52_UART1_TASKS_STOPRX          (NRF52_UART1_BASE + NRF52_UART_TASKS_STOPRX_OFFSET)
#  define NRF52_UART1_TASKS_STARTTX         (NRF52_UART1_BASE + NRF52_UART_TASKS_STARTTX_OFFSET)
#  define NRF52_UART1_TASKS_STOPTX          (NRF52_UART1_BASE + NRF52_UART_TASKS_STOPTX_OFFSET)
#  define NRF52_UART1_TASKS_SUSPEND         (NRF52_UART1_BASE + NRF52_UART_TASKS_SUSPEND_OFFSET)
#  define NRF52_UART1_EVENTS_CTS            (NRF52_UART1_BASE + NRF52_UART_EVENTS_CTS_OFFSET)
#  define NRF52_UART1_EVENTS_NCTS           (NRF52_UART1_BASE + NRF52_UART_EVENTS_NCTS_OFFSET)
#  define NRF52_UART1_EVENTS_RXDRDY         (NRF52_UART1_BASE + NRF52_UART_EVENTS_RXDRDY_OFFSET)
#  define NRF52_UART1_EVENTS_TXDRDY         (NRF52_UART1_BASE + NRF52_UART_EVENTS_TXDRDY_OFFSET)
#  define NRF52_UART1_EVENTS_ERROR          (NRF52_UART1_BASE + NRF52_UART_EVENTS_ERROR_OFFSET)
#  define NRF52_UART1_EVENTS_RXTO           (NRF52_UART1_BASE + NRF52_UART_EVENTS_RXTO_OFFSET)
#  define NRF52_UART1_SHORTS                (NRF52_UART1_BASE + NRF52_UART_SHORTS_OFFSET)
#  define NRF52_UART1_INTENSET              (NRF52_UART1_BASE + NRF52_UART_INTENSET_OFFSET)
#  define NRF52_UART1_INTENCLR              (NRF52_UART1_BASE + NRF52_UART_INTENCLR_OFFSET)
#  define NRF52_UART1_ERRORSRC              (NRF52_UART1_BASE + NRF52_UART_ERRORSRC_OFFSET)
#  define NRF52_UART1_ENABLE                (NRF52_UART1_BASE + NRF52_UART_ENABLE_OFFSET)
#  define NRF52_UART1_PSELRTS               (NRF52_UART1_BASE + NRF52_UART_PSELRTS_OFFSET)
#  define NRF52_UART1_PSELTXD               (NRF52_UART1_BASE + NRF52_UART_PSELTXD_OFFSET)
#  define NRF52_UART1_PSELCTS               (NRF52_UART1_BASE + NRF52_UART_PSELCTS_OFFSET)
#  define NRF52_UART1_PSELRXD               (NRF52_UART1_BASE + NRF52_UART_PSELRXD_OFFSET)
#  define NRF52_UART1_RXD                   (NRF52_UART1_BASE + NRF52_UART_RXD_OFFSET)
#  define NRF52_UART1_TXD                   (NRF52_UART1_BASE + NRF52_UART_TXD_OFFSET)
#  define NRF52_UART1_BAUDRATE              (NRF52_UART1_BASE + NRF52_UART_BAUDRATE_OFFSET)
#  define NRF52_UART1_CONFIG                (NRF52_UART1_BASE + NRF52_UART_CONFIG_OFFSET)
#endif

/* UART Register Bitfield Definitions **************************************/

/* PSELRTS Register */

#define UART_PSELRTS_PIN_SHIFT              (0)       /* Bits 0-4: Pin number*/
#define UART_PSELRTS_PIN_MASK               (0xf << UART_PSELRTS_PIN_SHIFT)
#define UART_PSELRTS_PORT_SHIFT             (5)       /* Bit 5: Port number */
#define UART_PSELRTS_PORT_MASK              (0x1 << UART_PSELRTS_PORT_SHIFT)
#define UART_PSELRTS_CONNECT                (1 << 31) /* Bit 31: Connection */
#define UART_PSELRTS_RESET                  (0xffffffff)

