apache/nuttx/arch/arm/src/nrf52/hardware/nrf52_uarte.h
/* PSELTXD Register */

#define UART_PSELTXD_PIN_SHIFT              (0)       /* Bits 0-4: Pin number*/
#define UART_PSELTXD_PIN_MASK               (0xf << UART_PSELTXD_PIN_SHIFT)
#define UART_PSELTXD_PORT_SHIFT             (5)       /* Bit 5: Port number */
#define UART_PSELTXD_PORT_MASK              (0x1 << UART_PSELTXD_PORT_SHIFT)
#define UART_PSELTXD_CONNECT                (1 << 31) /* Bit 31: Connection */
#define UART_PSELTXD_RESET                  (0xffffffff)

/* PSELCTS Register */

#define UART_PSELCTS_PIN_SHIFT              (0)       /* Bits 0-4: Pin number*/
#define UART_PSELCTS_PIN_MASK               (0xf << UART_PSELCTS_PIN_SHIFT)
#define UART_PSELCTS_PORT_SHIFT             (5)       /* Bit 5: Port number */
#define UART_PSELCTS_PORT_MASK              (0x1 << UART_PSELCTS_PORT_SHIFT)
#define UART_PSELCTS_CONNECT                (1 << 31) /* Bit 31: Connection */
#define UART_PSELCTS_RESET                  (0xffffffff)

/* PSELRXD Register */

#define UART_PSELRXD_PIN_SHIFT              (0)       /* Bits 0-4: Pin number*/
#define UART_PSELRXD_PIN_MASK               (0xf << UART_PSELRXD_PIN_SHIFT)
#define UART_PSELRXD_PORT_SHIFT             (5)       /* Bit 5: Port number */
#define UART_PSELRXD_PORT_MASK              (0x1 << UART_PSELRXD_PORT_SHIFT)
#define UART_PSELRXD_CONNECT                (1 << 31) /* Bit 31: Connection */
#define UART_PSELRXD_RESET                  (0xffffffff)

/* ENABLE Register */

#define NRF52_UART_ENABLE_DISABLE           (0)
#define NRF52_UART_ENABLE_ENABLE            (4)

/* INTEN/INTENSET/INTENCLR Register */

#define UART_INT_CTS                        (1 << 0)
#define UART_INT_NCTS                       (1 << 1)
#define UART_INT_RXDRDY                     (1 << 2)
#define UART_INT_ENDRX                      (1 << 4)
#define UART_INT_TXDRDY                     (1 << 7)
#define UART_INT_ENDTX                      (1 << 8)
#define UART_INT_ERROR                      (1 << 9)
#define UART_INT_RXTO                       (1 << 17)
#define UART_INT_RXSTARTED                  (1 << 19)
#define UART_INT_TXSTARTED                  (1 << 20)
#define UART_INT_TXSTOPPED                  (1 << 22)

/* BAUDRATE Register */

#if defined(CONFIG_ARCH_CHIP_NRF52832)
#  define UART_BAUDRATE_1200                (0x0004f000)
#  define UART_BAUDRATE_2400                (0x0009d000)
#  define UART_BAUDRATE_4800                (0x0013b000)
#  define UART_BAUDRATE_9600                (0x00275000)
#  define UART_BAUDRATE_14400               (0x003b0000)
#  define UART_BAUDRATE_19200               (0x004ea000)
#  define UART_BAUDRATE_28800               (0x0075f000)
#  define UART_BAUDRATE_38400               (0x009d5000)
#  define UART_BAUDRATE_57600               (0x00ebf000)
#  define UART_BAUDRATE_76000               (0x013a9000)
#  define UART_BAUDRATE_115200              (0x01d7e000)
#  define UART_BAUDRATE_230400              (0x03afb000)
#  define UART_BAUDRATE_250000              (0x04000000)
#  define UART_BAUDRATE_460800              (0x075f7000)
#  define UART_BAUDRATE_921600              (0x0ebed000)
#  define UART_BAUDRATE_1000000             (0x10000000)
#elif defined(CONFIG_ARCH_CHIP_NRF52833)
#  define UART_BAUDRATE_1200                (0x0004f000)
#  define UART_BAUDRATE_2400                (0x0009d000)
#  define UART_BAUDRATE_4800                (0x0013b000)
#  define UART_BAUDRATE_9600                (0x00275000)
#  define UART_BAUDRATE_14400               (0x003b0000)
#  define UART_BAUDRATE_19200               (0x004ea000)
#  define UART_BAUDRATE_28800               (0x0075f000)
#  define UART_BAUDRATE_31250               (0x00800000)
#  define UART_BAUDRATE_38400               (0x009d5000)
#  define UART_BAUDRATE_56000               (0x00e50000)
#  define UART_BAUDRATE_57600               (0x00ebf000)
#  define UART_BAUDRATE_76000               (0x013a9000)
#  define UART_BAUDRATE_115200              (0x01d7e000)
#  define UART_BAUDRATE_230400              (0x03afb000)
#  define UART_BAUDRATE_250000              (0x04000000)
#  define UART_BAUDRATE_460800              (0x075f7000)
#  define UART_BAUDRATE_921600              (0x0ebed000)
#  define UART_BAUDRATE_1000000             (0x10000000)
#elif defined(CONFIG_ARCH_CHIP_NRF52840)
#  define UART_BAUDRATE_1200                (0x0004f000)
#  define UART_BAUDRATE_2400                (0x0009d000)
#  define UART_BAUDRATE_4800                (0x0013b000)
#  define UART_BAUDRATE_9600                (0x00275000)
#  define UART_BAUDRATE_14400               (0x003af000)
#  define UART_BAUDRATE_19200               (0x004ea000)
#  define UART_BAUDRATE_28800               (0x0075c000)
#  define UART_BAUDRATE_31250               (0x00800000)
#  define UART_BAUDRATE_38400               (0x009d0000)
#  define UART_BAUDRATE_56000               (0x00e50000)
#  define UART_BAUDRATE_57600               (0x00eb0000)
#  define UART_BAUDRATE_76000               (0x013a9000)
#  define UART_BAUDRATE_115200              (0x01d60000)
#  define UART_BAUDRATE_230400              (0x03b00000)
#  define UART_BAUDRATE_250000              (0x04000000)
#  define UART_BAUDRATE_460800              (0x07400000)
#  define UART_BAUDRATE_921600              (0x0f000000)
#  define UART_BAUDRATE_1000000             (0x10000000)
#endif

/* CONFIG Register */

#define UART_CONFIG_HWFC                    (1 << 0) /* Bit 0: Hardware flow control */
#define UART_CONFIG_PARITY_SHIFT            (1)      /* Bits 1-3: Parity */
#define UART_CONFIG_PARITY                  (7 << UART_CONFIG_PARITY_SHIFT)

#if defined(CONFIG_ARCH_CHIP_NRF52833) || defined(CONFIG_ARCH_CHIP_NRF52840)
#  define UART_CONFIG_STOP                  (1 << 4) /* Bit 4: Stop bits */
#endif

#ifdef CONFIG_ARCH_CHIP_NRF52833
#  define UART_CONFIG_PARITYTYPE            (1 << 8) /* Bit 8: Parity type */
#endif

#endif /* __ARCH_ARM_SRC_NRF52_HARDWARE_NRF52_UARTE_H */
